Documents/ОтправкаГрузов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ОтправкаГрузов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетГрузов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСклада</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Отправка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Груз</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Грузы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Судно</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Судна</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправлени</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОтправкаГрузов/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ОтправкаГрузов.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтправкаГрузов.Дата,
	|	ОтправкаГрузов.Номер,
	|	ОтправкаГрузов.Ответственный,
	|	ОтправкаГрузов.Склад,
	|	ОтправкаГрузов.ТЧ_Отправка.(
	|		НомерСтроки,
	|		Груз,
	|		Судно,
	|		ДатаОтправлени
	|	)
	|ИЗ
	|	Документ.ОтправкаГрузов КАК ОтправкаГрузов
	|ГДЕ
	|	ОтправкаГрузов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЧ_ОтправкаШапка = Макет.ПолучитьОбласть("ТЧ_ОтправкаШапка");
	ОбластьТЧ_Отправка = Макет.ПолучитьОбласть("ТЧ_Отправка");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТЧ_ОтправкаШапка);
		ВыборкаТЧ_Отправка = Выборка.ТЧ_Отправка.Выбрать();
		Пока ВыборкаТЧ_Отправка.Следующий() Цикл
			ОбластьТЧ_Отправка.Параметры.Заполнить(ВыборкаТЧ_Отправка);
			ТабДок.Вывести(ОбластьТЧ_Отправка, ВыборкаТЧ_Отправка.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
